package by.it.zavadski.jd01_06;
/**TaskC2. Сформировать и вернуть в методе String slow (String text) из случайных слов
исходного текста строку String минимум в сто тысяч символов путем конкатенации. Слова
должны быть «склеены» через один пробел. Затем:
 • В методе main: определить время работы метода slow (удобно использовать
System.nanoTime() или аналог); вывести полученный текст и время работы метода slow в милисекундах на консоль.
 • Ускорить процесс с StringBuilder (сделать новый метод String fast (String text),
ВАЖНО: его итог должен быть таким как в slow до буквы). В main повторить вывод.
*/
public class TaskC2 {
}
